@pawelsz-rb With our existing tokens, this change is forcing us to re-create all our tokens. From the Terraform plan:

```
  # rollbar_project_access_token.foo must be replaced
-/+ resource "rollbar_project_access_token" "foo" {
      ~ access_token                = (sensitive value)
      ~ cur_rate_limit_window_count = 0 -> (known after apply)
      ~ cur_rate_limit_window_start = 1703176242 -> (known after apply)
      ~ date_created                = 1703176242 -> (known after apply)
      ~ date_modified               = 1703176242 -> (known after apply)
      ~ id                          = "[redacted]" -> (known after apply)
        name                        = "foo"
      + public_id                   = (known after apply)
      + token_type                  = "legacy" # forces replacement
        # (5 unchanged attributes hidden)
    }
```

What is the migration path here if we don't want to replace all our existing tokens?